package day0303;
// 기본형 데이터타입 01
// 정수형 데이터타입

// 정수란?
// 소숫점이 존재하지 않는 온전한 숫자
// 컴퓨터는 디지털 코드로만 값을 저장하므로
// 정수형 데이터타입들인 byte, short, int, long 모두
// 2진법 숫자를 저장하되, 각각 저장할 수 있는 크기가 다르다.

// byte: 8비트. -2의 7승 부터 2의 7승 -1까지 총 2의 8승개의 숫자를 저장 가능.
// short: 16비트. -2의 15승 부터 2의 15승 -1까지 총 2의 16승개의 숫자를 저장 가능.
// int: 32비트. -2의 31승 부터 2의 31승 -1까지 총 2의 32승개의 숫자를 저장 가능.
// long: 64비트. -2의 63승 부터 2의 63승 -1까지 총 2의 64승개의 숫자를 저장 가능.

// 단, 더이상 byte 혹은 short의 사용은 하지 않으므로
// 여러분들은 -20억~+20억일 경우에는 int를, 그보다 큰 수의 경우에는 long을 사용하면 된다.

public class Ex01Integer {

}
