package day0302;
// 자바의 명명규칙(Naming Convention)

// 1. 공통규칙
// A. 자바는 대소문자를 엄격하게 구분하는 언어로써,
//    만약 대소문자가 다르면, 다른 존재이다.
// B. 자바의 모든 것들은 _를 제외한 특수문자를
//    이름에 사용할 수 없다.
// C. 이름의 중간 혹은 끝에 숫자가 나올 수 있지만
//    시작할 때에는 숫자가 나올 수 없다.
// D. 자바에서는 내부적으로 사용하는 50여가지의
//    명령어가 존재한다.
//    우리가 그러한 명령어를 키워드라고 부르는데
//    키워드로 이름을 지어줄 수 없다.
//    따라서 여러분들은 해당하는 50여가지의 키워드를
//    모두 암기하셔야 한다!!! -> 내일 7시 시험 -> 옛날 옛적 이야기...
//    이클립스는 키워드를 자주색으로 표시를 해준다.

// 2. 낙타등 표기법(Camel Back Notation)
//    낙타등 표기법이란, 어떤 이름이 여러개의 단어를 이루어져 있을 경우
//    단어 간의 구분을 쉽게하기 위해서 두번째 단어부터는 매 단어의 첫글자를
//    대문자로 적어주는 표기법을 뜻한다.

// 3. 뱀 표기법(Snake Notation)
//    뱀 표기법이란, 모든 철자를 대문자로 적어주는 경우,
//    각 단어의 사이에 _를 넣어서 단어의 구분을 쉽게 할 수 있게 하는 표기법이다.

// 4. 여러가지 종류에 따른 명명 규칙
// A. 클래스의 이름은 대문자로 시작하고 낙타등 표기법을 사용하는 명사이다.
// B. 패키지의 이름은 소문자로 시작하고 명사를 사용하되, 해당 패키지 안에 있는
//    클래스들의 성격을 주로 한단어로 표현한다.
// C. 변수의 이름은 소문자로 시작하고 낙타등 표기법을 사용하는 명사이다.
// D. 상수의 이름은 뱀 표기법을 사용하는 명사이다.
// E. 메소드의 이름은 소문자로 시작하고 낙타등 표기법을 사용하는 동사이다.


public class Ex03Naming {

}
